pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
<?xml version="1.0" ?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>HC32M413</name>
    <version>1.0</version>
    <description>HC32M413</description>
    <cpu>
        <name>CM4</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <resetValue>0x0</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <peripheral>
            <name>ADC</name>
            <description>desc ADC</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40030000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC4</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC</name>
                <description>ADC interrupt</description>
                <value>73</value>
            </interrupt>
            <registers>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STRT</name>
                            <description>desc STRT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR0</name>
                    <description>desc CR0</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x800</resetValue>
                    <resetMask>0x7C7</resetMask>
                    <fields>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLREN</name>
                            <description>desc CLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFMT</name>
                            <description>desc DFMT</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVCNT</name>
                            <description>desc AVCNT</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xC0</resetValue>
                    <resetMask>0xC4</resetMask>
                    <fields>
                        <field>
                            <name>RSCHSEL</name>
                            <description>desc RSCHSEL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SREF</name>
                            <description>desc SREF</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F00</resetMask>
                    <fields>
                        <field>
                            <name>OVSS</name>
                            <description>desc OVSS</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSMOD</name>
                            <description>desc OVSMOD</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSELRA</name>
                    <description>desc CHSELRA</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHSELA</name>
                            <description>desc CHSELA</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHSELRB</name>
                    <description>desc CHSELRB</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHSELB</name>
                            <description>desc CHSELB</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AVCHSELR</name>
                    <description>desc AVCHSELR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AVCHSEL</name>
                            <description>desc AVCHSEL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TRGSR</name>
                    <description>desc TRGSR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x878787</resetMask>
                    <fields>
                        <field>
                            <name>TRGSELA</name>
                            <description>desc TRGSELA</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENA</name>
                            <description>desc TRGENA</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGSELB</name>
                            <description>desc TRGSELB</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENB</name>
                            <description>desc TRGENB</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGSELC</name>
                            <description>desc TRGSELC</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENC</name>
                            <description>desc TRGENC</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTR0</name>
                    <description>desc SSTR0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR1</name>
                    <description>desc SSTR1</description>
                    <addressOffset>0x21</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR2</name>
                    <description>desc SSTR2</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR3</name>
                    <description>desc SSTR3</description>
                    <addressOffset>0x23</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR4</name>
                    <description>desc SSTR4</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR5</name>
                    <description>desc SSTR5</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR6</name>
                    <description>desc SSTR6</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR7</name>
                    <description>desc SSTR7</description>
                    <addressOffset>0x27</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR8</name>
                    <description>desc SSTR8</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR9</name>
                    <description>desc SSTR9</description>
                    <addressOffset>0x29</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR10</name>
                    <description>desc SSTR10</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR11</name>
                    <description>desc SSTR11</description>
                    <addressOffset>0x2B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR12</name>
                    <description>desc SSTR12</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR13</name>
                    <description>desc SSTR13</description>
                    <addressOffset>0x2D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR14</name>
                    <description>desc SSTR14</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR15</name>
                    <description>desc SSTR15</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>CHSELRC</name>
                    <description>desc CHSELRC</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHSELC</name>
                            <description>desc CHSELC</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISR</name>
                    <description>desc ISR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x37</resetMask>
                    <fields>
                        <field>
                            <name>EOCAF</name>
                            <description>desc EOCAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOCBF</name>
                            <description>desc EOCBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOCCF</name>
                            <description>desc EOCCF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SASTPDF</name>
                            <description>desc SASTPDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SBSTPDF</name>
                            <description>desc SBSTPDF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <description>desc ICR</description>
                    <addressOffset>0x45</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>EOCAIEN</name>
                            <description>desc EOCAIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOCBIEN</name>
                            <description>desc EOCBIEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOCCIEN</name>
                            <description>desc EOCCIEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISCLRR</name>
                    <description>desc ISCLRR</description>
                    <addressOffset>0x46</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x37</resetMask>
                    <fields>
                        <field>
                            <name>CLREOCAF</name>
                            <description>desc CLREOCAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLREOCBF</name>
                            <description>desc CLREOCBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLREOCCF</name>
                            <description>desc CLREOCCF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRSASTPDF</name>
                            <description>desc CLRSASTPDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRSBSTPDF</name>
                            <description>desc CLRSBSTPDF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR0</name>
                    <description>desc DR0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
