pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>AOS</name>
            <description>desc AOS</description>
            <groupName>AOS</groupName>
            <baseAddress>0x40010800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x40</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>INTSFTTRG</name>
                    <description>desc INTSFTTRG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STRG</name>
                            <description>desc STRG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL0</name>
                    <description>desc DMA_TRGSEL0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL1</name>
                    <description>desc DMA_TRGSEL1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL2</name>
                    <description>desc DMA_TRGSEL2</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TRGSEL3</name>
                    <description>desc DMA_TRGSEL3</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RC_TRGSEL</name>
                    <description>desc DMA_RC_TRGSEL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCU_TRGSEL</name>
                    <description>desc DCU_TRGSEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR0_TRGSEL</name>
                    <description>desc TMR0_TRGSEL</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL0</name>
                    <description>desc TMRA_TRGSEL0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL1</name>
                    <description>desc TMRA_TRGSEL1</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR4_TRGSEL</name>
                    <description>desc TMR4_TRGSEL</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_TRGSEL0</name>
                    <description>desc ADC_TRGSEL0</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_TRGSEL1</name>
                    <description>desc ADC_TRGSEL1</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_TRGSEL2</name>
                    <description>desc ADC_TRGSEL2</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMTRGSEL1</name>
                    <description>desc COMTRGSEL1</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>COMTRG</name>
                            <description>desc COMTRG</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMTRGSEL2</name>
                    <description>desc COMTRGSEL2</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>COMTRG</name>
                            <description>desc COMTRG</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
