pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CMP1">
            <name>CMP2</name>
            <description>desc CMP</description>
            <groupName>CMP</groupName>
            <baseAddress>0x4004A100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CMP2</name>
                <description>CMP2 interrupt</description>
                <value>65</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="CMP1">
            <name>CMP3</name>
            <description>desc CMP</description>
            <groupName>CMP</groupName>
            <baseAddress>0x4004A400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CMP3</name>
                <description>CMP3 interrupt</description>
                <value>66</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>CMP_COMMON</name>
            <description>desc CMP_COMMON</description>
            <groupName>CMP_COMMON</groupName>
            <baseAddress>0x4004A000</baseAddress>
            <alternatePeripheral>CMP1</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x10</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DADR</name>
                    <description>desc DADR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>DADR</name>
                            <description>desc DADR</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACR</name>
                    <description>desc DACR</description>
                    <addressOffset>0xE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC9</resetMask>
                    <fields>
                        <field>
                            <name>DAEN</name>
                            <description>desc DAEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DA2POE</name>
                            <description>desc DA2POE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REFSEL</name>
                            <description>desc REFSEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CMU</name>
            <description>desc CMU</description>
            <groupName>CMU</groupName>
            <baseAddress>0x40054400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x49</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>XTAL_STOP</name>
                <description>Xtal stop interrupt</description>
                <value>36</value>
            </interrupt>
            <registers>
                <register>
                    <name>ADCKSEL</name>
                    <description>desc ADCKSEL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x107</resetMask>
                    <fields>
                        <field>
                            <name>ADCKDIV</name>
                            <description>desc ADCKDIV</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCKSEL</name>
                            <description>desc ADCKSEL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALSTDSR</name>
                    <description>desc XTALSTDSR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDF</name>
                            <description>desc XTALSTDF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCFGR</name>
                    <description>desc SCFGR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7007707</resetMask>
                    <fields>
                        <field>
                            <name>PCLK1S</name>
                            <description>desc PCLK1S</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK3S</name>
                            <description>desc PCLK3S</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK4S</name>
                            <description>desc PCLK4S</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLKS</name>
                            <description>desc HCLKS</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKSWR</name>
                    <description>desc CKSWR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>CKSW</name>
                            <description>desc CKSW</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALCR</name>
                    <description>desc XTALCR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTP</name>
                            <description>desc XTALSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALCFGR</name>
                    <description>desc XTALCFGR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>XTALDRV</name>
                            <description>desc XTALDRV</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFBPS</name>
                            <description>desc NFBPS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FREQSEL</name>
                            <description>desc FREQSEL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALMS</name>
                            <description>desc XTALMS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALSTBCR</name>
                    <description>desc XTALSTBCR</description>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTB</name>
                            <description>desc XTALSTB</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRCCR</name>
                    <description>desc HRCCR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTP</name>
                            <description>desc HRCSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSCSTBSR</name>
                    <description>desc OSCSTBSR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x29</resetMask>
                    <fields>
                        <field>
                            <name>HRCSTBF</name>
                            <description>desc HRCSTBF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>XTALSTBF</name>
                            <description>desc XTALSTBF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLSTBF</name>
                            <description>desc PLLSTBF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCOCFGR</name>
                    <description>desc MCOCFGR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCOSEL</name>
                            <description>desc MCOSEL</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCODIV</name>
                            <description>desc MCODIV</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCOEN</name>
                            <description>desc MCOEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTALSTDCR</name>
                    <description>desc XTALSTDCR</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x87</resetMask>
                    <fields>
                        <field>
                            <name>XTALSTDIE</name>
                            <description>desc XTALSTDIE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDRE</name>
                            <description>desc XTALSTDRE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDRIS</name>
                            <description>desc XTALSTDRIS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTDE</name>
                            <description>desc XTALSTDE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
