pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
                <register>
                    <name>PORR9</name>
                    <description>desc PORR9</description>
                    <addressOffset>0x49</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR4</name>
                            <description>desc POR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR5</name>
                            <description>desc POR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR6</name>
                            <description>desc POR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR7</name>
                            <description>desc POR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRA</name>
                    <description>desc PORRA</description>
                    <addressOffset>0x4A</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR4</name>
                            <description>desc POR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR5</name>
                            <description>desc POR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR6</name>
                            <description>desc POR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR7</name>
                            <description>desc POR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRB</name>
                    <description>desc PORRB</description>
                    <addressOffset>0x4B</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR4</name>
                            <description>desc POR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR5</name>
                            <description>desc POR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR6</name>
                            <description>desc POR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR7</name>
                            <description>desc POR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRD</name>
                    <description>desc PORRD</description>
                    <addressOffset>0x4D</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR4</name>
                            <description>desc POR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR5</name>
                            <description>desc POR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR6</name>
                            <description>desc POR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR7</name>
                            <description>desc POR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRE</name>
                    <description>desc PORRE</description>
                    <addressOffset>0x4E</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POR0</name>
                            <description>desc POR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR1</name>
                            <description>desc POR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR2</name>
                            <description>desc POR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR3</name>
                            <description>desc POR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR4</name>
                            <description>desc POR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR5</name>
                            <description>desc POR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR6</name>
                            <description>desc POR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR7</name>
                            <description>desc POR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POTR0</name>
                    <description>desc POTR0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>POT0</name>
                            <description>desc POT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT1</name>
                            <description>desc POT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT2</name>
                            <description>desc POT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT3</name>
                            <description>desc POT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT4</name>
                            <description>desc POT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT5</name>
                            <description>desc POT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT6</name>
                            <description>desc POT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT7</name>
                            <description>desc POT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POTR1</name>
                    <description>desc POTR1</description>
                    <addressOffset>0x51</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>POT0</name>
                            <description>desc POT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT1</name>
                            <description>desc POT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT2</name>
                            <description>desc POT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT3</name>
                            <description>desc POT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT4</name>
                            <description>desc POT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT5</name>
                            <description>desc POT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT6</name>
                            <description>desc POT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT7</name>
                            <description>desc POT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POTR2</name>
                    <description>desc POTR2</description>
                    <addressOffset>0x52</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>POT0</name>
                            <description>desc POT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT1</name>
                            <description>desc POT1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT2</name>
                            <description>desc POT2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT3</name>
                            <description>desc POT3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT4</name>
                            <description>desc POT4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT5</name>
                            <description>desc POT5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT6</name>
                            <description>desc POT6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT7</name>
                            <description>desc POT7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
