pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>HALL</name>
            <description>desc HALL</description>
            <groupName>HALL</groupName>
            <baseAddress>0x4001E800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x34</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HALL</name>
                <description>HALL interrupt</description>
                <value>63</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTLR</name>
                    <description>desc CTLR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x3000</resetValue>
                    <resetMask>0x37F1</resetMask>
                    <fields>
                        <field>
                            <name>HALLEN</name>
                            <description>desc HALLEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>desc CKDIV</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITENCHG</name>
                            <description>desc ITENCHG</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITENOVF</name>
                            <description>desc ITENOVF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITENSW</name>
                            <description>desc ITENSW</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAPCLR</name>
                            <description>desc CAPCLR</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWCLR</name>
                            <description>desc SWCLR</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FILR</name>
                    <description>desc FILR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x17FFF</resetMask>
                    <fields>
                        <field>
                            <name>FILLEN</name>
                            <description>desc FILLEN</description>
                            <msb>14</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIL75</name>
                            <description>desc FIL75</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INFR</name>
                    <description>desc INFR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70707</resetMask>
                    <fields>
                        <field>
                            <name>FILDAT</name>
                            <description>desc FILDAT</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RAWDAT</name>
                            <description>desc RAWDAT</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHGF</name>
                            <description>desc CHGF</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVRFF</name>
                            <description>desc OVRFF</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWF</name>
                            <description>desc SWF</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAPR</name>
                    <description>desc CAPR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>THDR</name>
                    <description>desc THDR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>CNTR</name>
                    <description>desc CNTR</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
