pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>INTC</name>
            <description>desc INTC</description>
            <groupName>INTC</groupName>
            <baseAddress>0x40051000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2AC</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>GLOBAL0_SWINT0</name>
                <description>global interrupt 0 or software interrupt 0</description>
                <value>0</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL1_SWINT1</name>
                <description>global interrupt 1 or software interrupt 1</description>
                <value>1</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL2_SWINT2</name>
                <description>global interrupt 2 or software interrupt 2</description>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL3_SWINT3</name>
                <description>global interrupt 3 or software interrupt 3</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL4_SWINT4</name>
                <description>global interrupt 4 or software interrupt 4</description>
                <value>4</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL5_SWINT5</name>
                <description>global interrupt 5 or software interrupt 5</description>
                <value>5</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL6_SWINT6</name>
                <description>global interrupt 6 or software interrupt 6</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL7_SWINT7</name>
                <description>global interrupt 7 or software interrupt 7</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL8_SWINT8</name>
                <description>global interrupt 8 or software interrupt 8</description>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL9_SWINT9</name>
                <description>global interrupt 9 or software interrupt 9</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL10_SWINT10</name>
                <description>global interrupt 10 or software interrupt 10</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL11_SWINT11</name>
                <description>global interrupt 11 or software interrupt 11</description>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL12_SWINT12</name>
                <description>global interrupt 12 or software interrupt 12</description>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL13_SWINT13</name>
                <description>global interrupt 13 or software interrupt 13</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL14_SWINT14</name>
                <description>global interrupt 14 or software interrupt 14</description>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>GLOBAL15_SWINT15</name>
                <description>global interrupt 15 or software interrupt 15</description>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>EXTINT0_SWINT16</name>
                <description>external interrupt 0 or software interrupt 16</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>EXTINT1_SWINT17</name>
                <description>external interrupt 1 or software interrupt 17</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>EXTINT2_SWINT18</name>
                <description>external interrupt 2 or software interrupt 18</description>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>EXTINT3_SWINT19</name>
                <description>external interrupt 3 or software interrupt 19</description>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>EXTINT4_SWINT20</name>
                <description>external interrupt 4 or software interrupt 20</description>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>EXTINT5_SWINT21</name>
                <description>external interrupt 5 or software interrupt 21</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>EXTINT6_SWINT22</name>
                <description>external interrupt 6 or software interrupt 22</description>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>EXTINT7_SWINT23</name>
                <description>external interrupt 7 or software interrupt 23</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>FPU_ERR</name>
                <description>FPU error interrupt</description>
                <value>32</value>
            </interrupt>
            <registers>
                <register>
                    <name>NMICR</name>
                    <description>desc NMICR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B1</resetMask>
                    <fields>
                        <field>
                            <name>NMITRG</name>
                            <description>desc NMITRG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMPCLK</name>
                            <description>desc SMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN</name>
                            <description>desc NFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIER</name>
                    <description>desc NMIER</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x92F</resetMask>
                    <fields>
                        <field>
                            <name>NMIEN</name>
                            <description>desc NMIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDTEN</name>
                            <description>desc SWDTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1EN</name>
                            <description>desc PVD1EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2EN</name>
                            <description>desc PVD2EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTPEN</name>
                            <description>desc XTALSTPEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPARERREN</name>
                            <description>desc RPARERREN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTEN</name>
                            <description>desc WDTEN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIFR</name>
                    <description>desc NMIFR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x92F</resetMask>
                    <fields>
                        <field>
                            <name>NMIF</name>
                            <description>desc NMIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTF</name>
                            <description>desc SWDTF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PVD1F</name>
                            <description>desc PVD1F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PVD2F</name>
                            <description>desc PVD2F</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>XTALSTPF</name>
                            <description>desc XTALSTPF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RPARERRF</name>
                            <description>desc RPARERRF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WDTF</name>
                            <description>desc WDTF</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIFCR</name>
                    <description>desc NMIFCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x92F</resetMask>
                    <fields>
                        <field>
                            <name>NMIFCLR</name>
                            <description>desc NMIFCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SWDTFCLR</name>
                            <description>desc SWDTFCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PVD1FCLR</name>
                            <description>desc PVD1FCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PVD2FCLR</name>
                            <description>desc PVD2FCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>XTALSTPFCLR</name>
                            <description>desc XTALSTPFCLR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RPARERRFCLR</name>
                            <description>desc RPARERRFCLR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WDTFCLR</name>
                            <description>desc WDTFCLR</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR0</name>
                    <description>desc EIRQCR0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR1</name>
                    <description>desc EIRQCR1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR2</name>
                    <description>desc EIRQCR2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
