pyocd/pyOCD/pyocd/debug/svd/data/HC32M413.svd
                <register>
                    <name>PSCR</name>
                    <description>desc PSCR</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x55550000</resetValue>
                    <resetMask>0xFFFF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>OEUH</name>
                            <description>desc OEUH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEUL</name>
                            <description>desc OEUL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEVH</name>
                            <description>desc OEVH</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEVL</name>
                            <description>desc OEVL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEWH</name>
                            <description>desc OEWH</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEWL</name>
                            <description>desc OEWL</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEXH</name>
                            <description>desc OEXH</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEXL</name>
                            <description>desc OEXL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MOE</name>
                            <description>desc MOE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AOE</name>
                            <description>desc AOE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ODT</name>
                            <description>desc ODT</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSUH</name>
                            <description>desc OSUH</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSUL</name>
                            <description>desc OSUL</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSVH</name>
                            <description>desc OSVH</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSVL</name>
                            <description>desc OSVL</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSWH</name>
                            <description>desc OSWH</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSWL</name>
                            <description>desc OSWL</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSXH</name>
                            <description>desc OSXH</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSXL</name>
                            <description>desc OSXL</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BFCRU</name>
                    <description>desc BFCRU</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000F</resetMask>
                    <fields>
                        <field>
                            <name>OCRSBUFENH</name>
                            <description>desc OCRSBUFENH</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSBUFENL</name>
                            <description>desc OCRSBUFENL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCH</name>
                            <description>desc OCRSLMCH</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCL</name>
                            <description>desc OCRSLMCL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BFCRV</name>
                    <description>desc BFCRV</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000F</resetMask>
                    <fields>
                        <field>
                            <name>OCRSBUFENH</name>
                            <description>desc OCRSBUFENH</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSBUFENL</name>
                            <description>desc OCRSBUFENL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCH</name>
                            <description>desc OCRSLMCH</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCL</name>
                            <description>desc OCRSLMCL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BFCRW</name>
                    <description>desc BFCRW</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000F</resetMask>
                    <fields>
                        <field>
                            <name>OCRSBUFENH</name>
                            <description>desc OCRSBUFENH</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSBUFENL</name>
                            <description>desc OCRSBUFENL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCH</name>
                            <description>desc OCRSLMCH</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCL</name>
                            <description>desc OCRSLMCL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BFCRX</name>
                    <description>desc BFCRX</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000F</resetMask>
                    <fields>
                        <field>
                            <name>OCRSBUFENH</name>
                            <description>desc OCRSBUFENH</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSBUFENL</name>
                            <description>desc OCRSBUFENL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCH</name>
                            <description>desc OCRSLMCH</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCL</name>
                            <description>desc OCRSLMCL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPCR</name>
                    <description>desc CPCR</description>
                    <addressOffset>0x70</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CPSRLMCP</name>
                            <description>desc CPSRLMCP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPSRLMCZ</name>
                            <description>desc CPSRLMCZ</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRU</name>
                    <description>desc PFSRU</description>
                    <addressOffset>0x82</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARU</name>
                    <description>desc PDARU</description>
                    <addressOffset>0x84</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRU</name>
                    <description>desc PDBRU</description>
                    <addressOffset>0x86</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRV</name>
                    <description>desc PFSRV</description>
                    <addressOffset>0x8A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARV</name>
                    <description>desc PDARV</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRV</name>
                    <description>desc PDBRV</description>
                    <addressOffset>0x8E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRW</name>
                    <description>desc PFSRW</description>
                    <addressOffset>0x92</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARW</name>
                    <description>desc PDARW</description>
                    <addressOffset>0x94</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRW</name>
                    <description>desc PDBRW</description>
                    <addressOffset>0x96</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRX</name>
                    <description>desc PFSRX</description>
                    <addressOffset>0x9A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARX</name>
                    <description>desc PDARX</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRX</name>
                    <description>desc PDBRX</description>
                    <addressOffset>0x9E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>POCRU</name>
                    <description>desc POCRU</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMD</name>
                            <description>desc PWMMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCRV</name>
                    <description>desc POCRV</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMD</name>
                            <description>desc PWMMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCRW</name>
                    <description>desc POCRW</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMD</name>
                            <description>desc PWMMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
